Synwit-Co-Ltd/IEC60335_CLASSB/SWM330_IEC60335/APP/main.c
#include "SWM330.h"
#include "main.h"

#include "SelfTest_param.h"
#include "SelfTest_lib.h"

void SerialInit(void);

int main(void)
{
 	SystemInit();
	
	SerialInit();
	
	GPIO_INIT(GPIOA, PIN5, GPIO_OUTPUT);
	
 	while(1==1)
 	{
    SelfTest_DoRunTimeChecks();
 	}
}

__IO uint32_t uwTick;
void IncTick(void)
{
  uwTick++;
}
uint32_t GetTick(void)
{
  return uwTick;
}


uint32_t RTC_GetSubSecond(void)
{
	return TIMR1->VALUE;
	
}

void SetSystemClock(void)
{
	SystemInit();  //PLL 
}

#if 0
void SerialInit(void)
{
	UART_InitStructure UART_initStruct;
	
	PORT_Init(PORTA, PIN6, FUNMUX0_UART0_TXD, 0);
	PORT_Init(PORTA, PIN7, FUNMUX1_UART0_RXD, 1);
 	
 	UART_initStruct.Baudrate = 57600;
	UART_initStruct.DataBits = UART_DATA_8BIT;
	UART_initStruct.Parity = UART_PARITY_NONE;
	UART_initStruct.StopBits = UART_STOP_1BIT;
	UART_initStruct.RXThreshold = 3;
	UART_initStruct.RXThresholdIEn = 0;
	UART_initStruct.TXThreshold = 3;
	UART_initStruct.TXThresholdIEn = 0;
	UART_initStruct.TimeoutTime = 10;
	UART_initStruct.TimeoutIEn = 0;
 	UART_Init(UART0, &UART_initStruct);
	UART_Open(UART0);
}

int fputc(int ch, FILE *f)
{
	UART_WriteByte(UART0, ch);
	
	while(UART_IsTXBusy(UART0));
 	
	return ch;
}
#endif

